{
    
    "mainPage": {
        "welcome": "Hello.",
        "introduction":"I'm Omar Boulbaze!",
        "description":"I am a Web Developer and Designer with a passion for technology and design. Learning, improving and getting things done every single day. One day at a time."
    },
    "experiences":{
        "title":"My recent work",
        "learnMore":"Learn more about this project",
        "sunsetradio":{
            "title":"Sunset Radio",
            "description":"Sunset Radio is a web-based francophone community radio station. I worked on the development of the website as well as the design of a music bot on a communication platform called Discord."
        },
        "tcorner":{
            "title":"Technological Corner",
            "description":"TCorner is a school team project, I was in charge of the development of a static website containing general informations about our project, our goal, as well as a list of all team members."
        },
        "easynps":{
            "title":"Easy NPS",
            "description":"Easy NPS is a tool that makes the completion of customer satisfaction surveys in retail stores easy. Customers can now simply access surveys by scanning a QR code generated by a sales associate."
        },
        "cookiej":{
            "title":"CookieJ",
            "description":"CookieJ is a mobile/web application based on The Cookie Jar technique, which consists of using your past achievements to motivate yourself when you're struggling. You make a list of all your victories and triumphs along with obstacles and challenges you overcame."
        }
    },
    "quote":{
        "quote0":{
            "content":"“The people who are crazy enough to think they can change the world are the ones who do.”",
            "author":"— Steve Jobs"
        }
    },
    "changeButtonLanguage":"Français",
    "easynps":{
        "title":"Easy NPS",
        "description":"Easy NPS is a tool that makes the completion of customer satisfaction surveys in retail stores easy. Customers can now simply access surveys by scanning a QR code generated by a sales associate.",
        "Live_Preview":"Live Preview",
        "Source_Code":"Source Code",
        "Likes":"Likes",
        "Preview":"Preview",
        "Technologies_Used":"Technologies Used",
        "My_Role":"My Role",
        "Notable_Features":"Notable Features",
        "Project_Challenges":"Project Challenges",
        "My_Solutions":"My Solutions",
        "html":{
            "My_Role": "My main goal is to make a Full-Stack Progressive Web Application. Implementing a responsive UI design with CSS3 combined with optimized UX concepts using ReactJS. The data collected is stored in a MongoDB database while using NodeJS as the runtime environment and ExpressJS for the server-side REST API.",
            "Notable_Features":["QR Code generator making the access to the survey easier.","Responsive design on web and mobile using CSS3.","Code Athentification in order to avoid duplicate reviews.","\"Remember me\" feature (Associate's informations) when generating a QR code, making it faster for the sales associates."],
            "Project_Challenges":["Fast and responsive layout on mobile. 100% of our users are on mobile since the QR Code is scanned using their camera.","Minimalist UI/UX for Sales Associates. The QR code generator tool should be simple and efficient."],
            "My_Solutions":["Deploying the application as a PWA (Progressive Web Application), giving users multiples advantages similar to a native application.","Giving employees the possibility of saving Easy NPS on their homescreen and generating QR codes while offline."]
        }
    }
    

}